iainchesworthlabs/ac3forge/esp-idf/ac3forge/examples/stream_player/sdkconfig.defaults
# ESP-IDF configuration for the streaming player example.
#
# The same shape as the i2s_player example beside it - see that file for why
# each setting is what it is - plus a custom partition table, which is the one
# thing this example needs and that one does not.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# The audio partition lives here. Without this IDF uses its own single-factory
# table, which has nowhere to put a stream.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM stays off, as everywhere else in this profile: the point is that the
# decode fits in internal SRAM, and the streaming buffers are part of what has
# to fit.

# 240 MHz, asked for rather than inherited. ESP-IDF's default is 160, two
# thirds of what the part does, and a player that has to finish each frame
# inside the 32 ms the DAC takes to play it should name the clock it was
# measured at. apps/baremetal/platform/esp32s3/sdkconfig.defaults has the
# measurement: the decode scales with the clock almost exactly, so this is the
# single largest setting on the part.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
